# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'ffmpeg'
brew 'gifsicle'
brew 'git'
brew 'mas'
brew 'node'
brew 'wget'
brew 'yarn'

# Development
brew 'php71', args: ['with-debug', 'without-apache']
brew 'php71-intl'
brew 'httpie'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Apps
cask 'adapter'
cask 'aerial'
cask 'archiver'
cask 'dash'
cask 'dropbox'
cask 'google-chrome'
cask 'google-drive'
cask 'imageoptim'
cask 'jetbrains-toolbox'
cask 'mysqlworkbench'
cask 'postman'
cask 'sequel-pro'
cask 'skype'
cask 'sublime-text'
cask 'teamviewer'
cask 'tower'
cask 'x-quartz'

# Fonts
cask 'font-fira-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Apps from the AppStore
mas '1Password', id: 443987910
mas 'Amphetamine', id: 937984704
mas 'DaisyDisk', id: 411643860
mas 'Numbers', id: 409203825
mas 'Quip', id: 1003160018
mas 'Slack', id: 803453959
mas 'Spark', id: 1176895641
